app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "recruiting", "skills", "employability", "country", "city", "street", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
	def create
		@article = Article.new(article_params)
		if @article.save