app/controllers/profiles_controller.rb

	def new
		if user_signed_in?
			unless Profile.find_by(user_id:current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]